test_data/create_session_success_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
   <soap-env:Header>
      <eb:MessageHeader soap-env:mustUnderstand="1" eb:version="1.0">
         <eb:From>
            <eb:PartyId type="urn:x12.org:IO5:01">www.z.com</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId>
         </eb:To>
         <eb:CPAId>7ZTF</eb:CPAId>
         <eb:ConversationId>fds8789h|dev@z.com</eb:ConversationId>
         <eb:Service eb:type="OTA">SessionCreateRQ</eb:Service>
         <eb:Action>SessionCreateRQ</eb:Action>
         <eb:MessageData>
            <eb:MessageId>mid:20180216-07:18:42.3|14oUa</eb:MessageId>
            <eb:Timestamp>2018-02-19T20:09:01Z</eb:Timestamp>
            <eb:TimeToLive />
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">
         <wsse:UsernameToken>
            <wsse:Username>1234</wsse:Username>
            <wsse:Password>ZX012345</wsse:Password>
            <Organization>7ZTF</Organization>
            <Domain>DEFAULT</Domain>
         </wsse:UsernameToken>
      </wsse:Security>
   </soap-env:Header>
   <soap-env:Body>
      <eb:Manifest soap-env:mustUnderstand="1" eb:version="1.0">
         <eb:Reference xlink:href="cid:rootelement" xlink:type="simple" />
      </eb:Manifest>
      <ns:SessionCreateRQ xmlns:ns="http://www.opentravel.org/OTA/2002/11">
         <POS>
            <Source PseudoCityCode="7ZTF" />
         </POS>
      </ns:SessionCreateRQ>
   </soap-env:Body>
</soap-env:Envelope>